zhoubao-0824.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-09-01 周二 15:53 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>梁子的周报-08-24</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">梁子的周报-08-24</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgce5f072">1. 关于使用sketch作为核方法提升SVM精度的问题</a>
<ul>
<li><a href="#org3f6cb2a">1.1. SVM基本思路</a></li>
<li><a href="#org4212247">1.2. 把sketch作为非线性核的处理手段</a></li>
<li><a href="#org167cb3c">1.3. 基于sketch的核方法分类精度与线性分类器的分类精度比较</a></li>
</ul>
</li>
<li><a href="#orgb5d0d00">2. 对“可解释性”这个想法的验证</a>
<ul>
<li><a href="#org7e2d678">2.1. 代码进度</a></li>
</ul>
</li>
<li><a href="#orgaf3e624">3. online learning的调研</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgce5f072" class="outline-2">
<h2 id="orgce5f072"><span class="section-number-2">1</span> 关于使用sketch作为核方法提升SVM精度的问题</h2>
<div class="outline-text-2" id="text-1">
<p>
上一周在做实验的时候，发现基于sketch的核方法效果没有线性分类器好，这个结果与预期不符。因此又重新做了一系列实验，终于搞清楚了这个问题。
</p>
</div>

<div id="outline-container-org3f6cb2a" class="outline-3">
<h3 id="org3f6cb2a"><span class="section-number-3">1.1</span> SVM基本思路</h3>
<div class="outline-text-3" id="text-1-1">
<p>
SVM的基本思路是在特征空间中找到一个超平面将数据点进行分割。但是数据往往不是线性可分的，所以线性SVM的效果在现实数据集中表现并不理想（因为现实数据并不是线性可分）。
</p>

<p>
核方法是为了解决这种问题的一种思路：既然当前特征维度下数据不是线性可分，那么可以将特征映射到更高的维度，这样就可以构造出线性可分的超平面了。因而效果就会比较好。
</p>
</div>
</div>

<div id="outline-container-org4212247" class="outline-3">
<h3 id="org4212247"><span class="section-number-3">1.2</span> 把sketch作为非线性核的处理手段</h3>
<div class="outline-text-3" id="text-1-2">
<p>
sketch方法原本的应用场景是：
</p>
<ol class="org-ol">
<li>数据降维。生成短小紧凑或者大而稀疏的特征向量，以节省内存；</li>
<li>快速使用。sketch可以作为中间过程快速应用在近似搜索等问题上；</li>
<li>应对特征维度不同的数据，与其他方法不同，sketch方法可以将数据映射成相同长度的“指纹”；</li>
</ol>

<p>
而在本工作的场景下，sketch除了具有上述的特征1之外，本身还充当了一种非线性核方法。
</p>
</div>
</div>

<div id="outline-container-org167cb3c" class="outline-3">
<h3 id="org167cb3c"><span class="section-number-3">1.3</span> 基于sketch的核方法分类精度与线性分类器的分类精度比较</h3>
<div class="outline-text-3" id="text-1-3">
<p>
在上述两条的基础上，应有：
</p>
<ol class="org-ol">
<li>如果sketch方法没有降低原始特征的维度，也没有使用诸如b-bit的方法节省内存，那么得到的精度要高于线性分类器的分类精度；</li>
<li>显然，sketch方法如果进行了降维或bbit这一类的手段，精度则会比不降维的sketch要差；</li>
<li>使用了降维的sketch方法在高维数据上的表现与线性分类器相比，具体的结果取决于压缩的比率。</li>
</ol>

<p>
我的实验结果和雷润泽的不一样，经过思考，主要原因是：数据集中特征维度不一致。
这是雷润泽使用的数据集、特征维度、sketch长度：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dataset</th>
<th scope="col" class="org-right">feature</th>
<th scope="col" class="org-left">k</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">pendigits</td>
<td class="org-right">16</td>
<td class="org-left">32,64,128,256,512,1024,2048</td>
</tr>

<tr>
<td class="org-left">satimage</td>
<td class="org-right">36</td>
<td class="org-left">32,64,128,256,512,1024,2048</td>
</tr>

<tr>
<td class="org-left">segment</td>
<td class="org-right">19</td>
<td class="org-left">32,64,128,256,512,1024,2048</td>
</tr>

<tr>
<td class="org-left">splice</td>
<td class="org-right">60</td>
<td class="org-left">32,64,128,256,512,1024,2048</td>
</tr>

<tr>
<td class="org-left">letter</td>
<td class="org-right">16</td>
<td class="org-left">32,64,128,256,512,1024,2048</td>
</tr>
</tbody>
</table>

<p>
我没有对所有的数据集进行重新实验，单单放上最后一个数据集的实验结果：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">method</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">feature</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">linear svm</td>
<td class="org-right">66.3</td>
<td class="org-right">16</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">gpmh-kernel+svm</td>
<td class="org-right">94.96</td>
<td class="org-right">512</td>
<td class="org-left">对生成的sketch每一个bucket用6-bit近似存储</td>
</tr>

<tr>
<td class="org-left">gpmh-kernel+svm</td>
<td class="org-right">49.18</td>
<td class="org-right">16</td>
<td class="org-left">同上</td>
</tr>

<tr>
<td class="org-left">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>


<p>
而按照微信群里的要求，我的数据集与基本的维度特征是这样的：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">dataset</th>
<th scope="col" class="org-left">feature</th>
<th scope="col" class="org-left">k</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">rcv1</td>
<td class="org-left">47,236</td>
<td class="org-left">32,64,128,256,512,1024,2048</td>
</tr>

<tr>
<td class="org-left">kdda</td>
<td class="org-left">20,216,830</td>
<td class="org-left">32,64,128,256,512,1024,2048</td>
</tr>
</tbody>
</table>

<p>
面对这样的高维数据集，在sketch长度没有增长的前提下，似乎精度的下跌也是无法避免的。在rcv1上进行实验的结果如下：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">method</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-right">feature</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">linear svm</td>
<td class="org-right">97.67</td>
<td class="org-right">47,236</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pmh-kernel+svm</td>
<td class="org-right">91.83</td>
<td class="org-right">64</td>
<td class="org-left">对生成的sketch每一个bucket用6-bit近似存储</td>
</tr>

<tr>
<td class="org-left">pmh-kernel+svm</td>
<td class="org-right">95.4</td>
<td class="org-right">128</td>
<td class="org-left">同上</td>
</tr>

<tr>
<td class="org-left">pmh-kernel+svm</td>
<td class="org-right">96.35</td>
<td class="org-right">256</td>
<td class="org-left">tongshang</td>
</tr>

<tr>
<td class="org-left">pmh-kernel+svm</td>
<td class="org-right">96.28</td>
<td class="org-right">512</td>
<td class="org-left">tongshang</td>
</tr>

<tr>
<td class="org-left">cws-kernel+svm</td>
<td class="org-right">94.43</td>
<td class="org-right">128</td>
<td class="org-left">tongshang</td>
</tr>
</tbody>
</table>


<p>
完了完了完了完了
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">method</th>
<th scope="col" class="org-right">acc</th>
<th scope="col" class="org-left">feature</th>
<th scope="col" class="org-right">k</th>
<th scope="col" class="org-right">b</th>
<th scope="col" class="org-left">备注</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">linear svm</td>
<td class="org-right">88.438</td>
<td class="org-left">20,216,830</td>
<td class="org-right">无</td>
<td class="org-right">无</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pmh</td>
<td class="org-right">86.78</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">32</td>
<td class="org-right">3</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">pmh</td>
<td class="org-right">86.78</td>
<td class="org-left">&#xa0;</td>
<td class="org-right">32</td>
<td class="org-right">2</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>






<p>
从表中可以看出：
</p>
<ol class="org-ol">
<li>sketch的方法很大的降低了特征维度，同时精度的降低并不是特别大。</li>
<li>时间原因，上述实验只进行了一次，不排除一些偶然性。比如pmh下512维得到的效果不如256维好。</li>
</ol>

<p>
综上所述，实验的结果和理论的分析是互相验证的。
</p>


<p>
其他的一些实验参数设定：
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">参数</th>
<th scope="col" class="org-left">描述</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">k</td>
<td class="org-left">k就是hash的次数，也就是sketch的长度，也就是上面使用了sketch方法的feature个数</td>
</tr>

<tr>
<td class="org-left">b</td>
<td class="org-left">每个bucket的存储位数</td>
</tr>

<tr>
<td class="org-left">c</td>
<td class="org-left">svm的一个超参数，实验中全部用的1</td>
</tr>
</tbody>
</table>



<p>
本来试图网格化参数放在服务器上跑，结果直接卡住了，在李、张、程学长的帮助下才解决。。耽误了一些时间。因此变为手动增加线程去做。还有一些维度比较高的实验没有出来结果，随时补充。
</p>

<p>
除此之外：
对于sketch降维会降低精度的问题，雷润泽曾经讲过一篇论文，flyhash，是将数据映射到高维稀疏空间的仿生sketch方法。这个方法没有降维，那会不会有较好的效果呢？虽然会提升特征的维度，但是后面W的乘法操作也就变成了加法，或许也不会增加后面的负担。
</p>
</div>
</div>
</div>


<div id="outline-container-orgb5d0d00" class="outline-2">
<h2 id="orgb5d0d00"><span class="section-number-2">2</span> 对“可解释性”这个想法的验证</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-org7e2d678" class="outline-3">
<h3 id="org7e2d678"><span class="section-number-3">2.1</span> 代码进度</h3>
<div class="outline-text-3" id="text-2-1">
<p>
实现这个思路主要是三步：
</p>
<ol class="org-ol">
<li>sketch-kernel与linear svm的实现 【已完成】</li>
<li>将batch learning 改为online learning 【正在做】</li>
<li>添加上新的互学习的部分 【没完成】</li>
</ol>

<p>
目前做到了第二步，由于接手的代码svm部分直接调用的liblinear库，而那个库默认就一个train()函数，因此修改为online learning模式需要对C++代码进行一些修改。我对C++不是很熟悉，所以看起来稍稍有点慢。并且，对于参数的优化该库使用了newton迭代法，这方法明明是用来求解非线性方程组的，我还没看明白。因此，由于语言的原因，这里的进度会稍稍慢一点。（不过也不能躲避，C++是数据挖掘里那么常用的语言）
而根据我对online learning的调研，以及对SIGMOD2018那篇论文源代码的阅读，基本的改进方法明白了。
</p>

<p>
对于第三步，我阅读了互学习那篇论文，同知识蒸馏类似，该论文是在交叉熵损失函数的基础上提出的。而目前SVM使用的损失函数并不是交叉熵。如何去适配是将来需要思考的。
</p>
</div>
</div>
</div>

<div id="outline-container-orgaf3e624" class="outline-2">
<h2 id="orgaf3e624"><span class="section-number-2">3</span> online learning的调研</h2>
<div class="outline-text-2" id="text-3">
<p>
还没弄完。。这周日晚上是我的小报告，我准备就到时候把它汇报了吧。 0.0
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-09-01 周二 15:53</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
